src/test/resources/EndPointInputs/PNRAddSegment_Input.xml

   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:qmo="http://schemas.datacontract.org/2004/07/QMO.PSS.Core" xmlns:qmo1="http://schemas.datacontract.org/2004/07/QMO.PSS.Model" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:PSSUpdatePNRsCommand>
         <!--Optional:-->
         <tem:connectionInfo>
             <qmo:City>HDQ</qmo:City>
            <qmo:ContractorCode>AAO</qmo:ContractorCode>
             <qmo:DutyCode>5</qmo:DutyCode>
            <qmo:Environment>%%envSabre%%</qmo:Environment>
            <qmo:Password>%%sabrePwd%%</qmo:Password>
            <qmo:UserName>%%sabre_userId%%</qmo:UserName>
         </tem:connectionInfo>
         <tem:requests>
            <qmo1:Commands>
               <!--Zero or more repetitions:-->
               <arr:string>0%%flight_no%%Y%%date%%%%depstation%%%%arrstation%%NN%%pax%%</arr:string>
               <arr:string>6P</arr:string>
               <arr:string>ER</arr:string>
            </qmo1:Commands>
            <!--Optional:-->
            <qmo1:PNR>%%PNR%%</qmo1:PNR>
         </tem:requests>
      </tem:PSSUpdatePNRsCommand>
   </soapenv:Body>
</soapenv:Envelope> 
